{
  "about": "Full-stack developer leveraging expertise in TypeScript, React, and front-end technologies to contribute innovative solutions and grow in a dynamic environment.",
  "experience": [
    {
      "company": "Lean Techniques",
      "position": "Professional Software Consultant",
      "duration": "August 2024 - Present",
      "description": "Developing solutions using TypeScript, React, and .NET. Key projects include modernizing legacy systems and creating scalable web applications with cloud integration."
    },
    {
      "company": "Lean Techniques",
      "position": "Software Engineer Intern",
      "duration": "June 2024 - August 2024",
      "description": "Developed a TypeScript-based mock photo album API using AWS and implemented serverless architecture. Evaluated React form builder libraries and authored comprehensive analyses to assist client decision-making."
    },
    {
      "company": "Moore Hearing Clinic",
      "position": "Digital Operations Specialist",
      "duration": "September 2015 - May 2024",
      "description": "Automated insurance calculations and payroll processes using Python, resulting in significant time savings and error reductions. Built a clinic management system with React and Node.js."
    }
  ],
  "skills": {
    "technical": [
      "TypeScript",
      "React",
      "Next.js",
      "C#",
      "Python",
      "AWS",
      "Azure",
      "Postgres",
      "TailwindCSS",
      "shadcn/ui"
    ],
    "soft": ["Communication", "Teamwork", "Problem-solving", "Adaptability"]
  },
  "projects": [
    {
      "name": "Revify SaaS Revenue Calculator",
      "description": "Built using Next.js, TailwindCSS, and Neon Postgres. Features include AI-powered growth predictions, add-on pricing customization, and real-time MRR calculations."
    },
    {
      "name": "Recipe Realm",
      "description": "Culinary platform developed with Flask and SQLite, featuring responsive design, user authentication, and a dynamic rating system."
    },
    {
      "name": "Crumbl Craver",
      "description": "Next.js and Supabase application for weekly Crumbl Cookie flavor updates. Integrated web scraper for data accuracy and real-time updates."
    }
  ],
  "education": {
    "university": "A.A.S. in Computer Software Development, Indian Hills Community College, Ottumwa, Iowa, August 2024",
    "certifications": []
  }
}
